Revit 2027 API
BuiltInFailures.FamilyFailures.FrozenBecauseFaceGone Property
 This family instance was hosted by a curved face that is no longer present in the linked file. To move the family instance, rehost it.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FrozenBecauseFaceGone { get; }
Public Shared ReadOnly Property FrozenBecauseFaceGone As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FrozenBecauseFaceGone {
	FailureDefinitionId^ get ();
}
static member FrozenBecauseFaceGone : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace